In [9]:
import pandas as pd

In [14]:
authors_stat = authors_price \
    .groupby("author_name", as_index=False) \
    .aggregate({ "price": [ "min", "max", "mean" ]}) \
    .rename(columns = {"min" : "min_price", "max" : "max_price", "mean": "mean_price"})
authors_stat

  author_name     price
              min_price max_price  mean_price
0  Островский       290       370  330.000000
1    Тургенев       300       450  366.666667
2       Чехов       450       500  475.000000